package lesson4.HomeWork;

public class PolindromHomeWork {
    public static void main(String[] args) {

        char[] massChar = {'е' , 'е' , 'н' , 'д' , 'е' , 'р' , 'с' , 'и' , ' ' , 'е' , 'о' , 'ш' , 'ь' , 'л' , 'о' , 'б' ,
                ' ' , 'е' , 'о' , 'м' , 'а' , 'с' , ' ' , 'и' , 'д' , 'й' , 'а' , 'н' , ' ' , 'и' , ' ' , 't' , 'n' , 'i' ,
                ' ' , 'а' , 'п' , 'и' , 'т' , ' ' , 'и' , 'м' , 'а' , 'т' , 'н' , 'е' , 'м' , 'е' , 'л' , 'э' , 'ю' ,
                '0' , '1' , ' ' , 'в' , 'и' , 'с' , 'с' , 'а' , 'м' , ' ' , 'и' , 'н' , 'л' , 'о' , 'п' , 'а' , 'з' ,
                ' ' , '2' , 'е' , 'и' , 'н' , 'а' , 'д' , 'а' , 'з' , ' ' , 'и' , 'ч' , 'а' , 'н' , 'о' , 'б' , 'и' , 'ф' ,
                ' ' , 'и' , 'м' , 'а' , 'л' , 'с' , 'и' , 'ч' , ' ' , 'в' , 'и' , 'с' , 'с' , 'а' , 'м' , ' ' , 'и' , 'н' , 'л' , 'о' ,
                'п' , 'а' , 'З' , ' ' , 'е' , 'о' , 'в' , 'р' , 'е' , 'п' , ' ' , 'е' , 'и' , 'н' , 'а' , 'д' , 'а' , 'З'
        };
        for (int i = massChar.length - 1; i >= -1; i--) {
            System.out.print(massChar[i]);
        }
    }
}